heatTransfer/chtMultiRegionFoam/solarBeamWithTrees/0.orig/floor/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    maxY
    {
        type            calculated;
        value           uniform 0;
    }

    minX
    {
        type            calculated;
        value           uniform 0;
    }

    maxX
    {
        type            calculated;
        value           uniform 0;
    }

    minY
    {
        type            calculated;
        value           uniform 0;
    }

    minZ
    {
        type            calculated;
        value           uniform 0;
    }

    floor_to_domain3
    {
        type            calculated;
        value           uniform 0;
    }

    floor_to_air
    {
        type            calculated;
        value           uniform 0;
    }

    floor_to_solid
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
