heatTransfer/chtMultiRegionFoam/solarBeamWithTrees/0.orig/solid/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 350;

boundaryField
{
    solid_to_domain3
    {
        type            fixedValue;
        value           uniform 300;
    }

    solid_to_air
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        value           uniform 350;
        Tnbr            T;
        kappaMethod     solidThermo;
        qrNbr           qr;
        qr              none;
        kappa           none;
    }

    solid_to_floor
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        value           uniform 300;
        Tnbr            T;
        kappaMethod     solidThermo;
        qrNbr           none;
        qr              none;
        kappa           none;
    }
}


// ************************************************************************* //
